
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/hawk0616/recruit-service-board-infla/actions/runs/6322772122)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
data.aws_iam_policy_document.ssm_get_parameter: Reading...
aws_ecr_repository.ecr_repository: Refreshing state... [id=recruit-service-board]
data.aws_ssm_parameter.rds_password: Reading...
data.aws_iam_policy_document.ecs_task_assume: Reading...
aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:113713103169:cluster/recruit-service-board]
aws_cloudwatch_log_group.cloudwatch_log_group: Refreshing state... [id=/aws/ecs/recruit-service-board]
aws_api_gateway_rest_api.api: Refreshing state... [id=rh57akzs83]
data.aws_iam_policy_document.ecs_assume: Reading...
data.aws_iam_policy_document.ssm_get_parameter: Read complete after 0s [id=3537814278]
data.aws_iam_policy_document.ecs_assume: Read complete after 0s [id=1077804475]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-06a74de91e584f523]
data.aws_iam_policy_document.lambda_assume: Reading...
data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=1077804475]
data.aws_iam_policy_document.lambda_assume: Read complete after 0s [id=2690255455]
aws_iam_policy.ssm_get_parameter: Refreshing state... [id=arn:aws:iam::113713103169:policy/recruit-service-board-ssm-get-parameter]
aws_iam_role.ecs_task: Refreshing state... [id=recruit-service-board-ecs-task]
aws_iam_role.ecs: Refreshing state... [id=recruit-service-board-ecs]
aws_iam_role.lambda_execution_role: Refreshing state... [id=recruit-service-board-lambda-execution]
aws_iam_role_policy_attachment.ecs_task_ssm_get_parameter: Refreshing state... [id=recruit-service-board-ecs-task-20230922172051413600000001]
aws_iam_role_policy_attachment.lambda_basic_execution: Refreshing state... [id=recruit-service-board-lambda-execution-20230925173849405600000002]
aws_iam_role_policy_attachment.lambda_vpc_access: Refreshing state... [id=recruit-service-board-lambda-execution-20230925173849359700000001]
aws_iam_role_policy_attachment.ecs_basic: Refreshing state... [id=recruit-service-board-ecs-20230918174618982500000001]
data.aws_ssm_parameter.rds_password: Read complete after 0s [id=/recruit-service-board/rds/password]
aws_api_gateway_resource.resource: Refreshing state... [id=qgpg3b]
aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=recruit-service-board]
aws_api_gateway_method.method: Refreshing state... [id=agm-rh57akzs83-qgpg3b-POST]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Refreshing state... [id=recruit-service-board]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0b4fa9cfb59fb8ed6]
aws_security_group.lambda_sg: Refreshing state... [id=sg-046b937d63c1b724e]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-00f307d2ae25b4534]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-045bc34d7c279cb27]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09e72ede8507a7ede]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-06d46b412cd4c9c97]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0c5a36c42816c6a6e]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0ef372ea55e63234b]
aws_security_group.alb: Refreshing state... [id=sg-0ea3a71bbd61c86a8]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-027284c710a0d8892]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-06b113e053f3b1456]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b66a8be9a7ddf00e]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0e0e6b1c0c1ac041b]
aws_subnet.rds_subnet_a: Refreshing state... [id=subnet-0e7f8c94361b73d2f]
aws_security_group.ecs: Refreshing state... [id=sg-01392c715b6f27337]
aws_subnet.rds_subnet_d: Refreshing state... [id=subnet-04400242864195eba]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:targetgroup/recruit-service-board-tg/454711001d84759e]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-07700ba4124e8d2ab]
aws_security_group_rule.lambda_access_rds: Refreshing state... [id=sgrule-3151332000]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-088311edf380f4573]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:loadbalancer/app/recruit-service-board-alb/56d6da1d3ef15356]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-031bf5efc3f63faec]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0dd3ed9e6c5dcdb96]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-00f307d2ae25b45341080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-09fbc8a2cc5227fc3]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-05212acebdfd26b46]
aws_db_subnet_group.my_db_subnet_group: Refreshing state... [id=recruit-service-board-db-subnet-group]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-1730019703]
aws_security_group.rds: Refreshing state... [id=sg-01d224fac4c4d51f5]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-00ecc0f91b532aa39]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0f95a65c3fedee2a9]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-09e72ede8507a7ede1080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0c5a36c42816c6a6e1080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:listener/app/recruit-service-board-alb/56d6da1d3ef15356/1eaa46f405a18931]
aws_db_instance.my_db_instance: Refreshing state... [id=db-KC5X2YWBBCAJQTD5C5W7HGNFKM]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:listener-rule/app/recruit-service-board-alb/56d6da1d3ef15356/1eaa46f405a18931/1426ab8034eecf22]
aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:113713103169:service/recruit-service-board/recruit-service-board]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_deployment.deployment will be created
  + resource "aws_api_gateway_deployment" "deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "rh57akzs83"
      + stage_name    = "prod"
    }

  # aws_api_gateway_integration.integration will be created
  + resource "aws_api_gateway_integration" "integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "qgpg3b"
      + rest_api_id             = "rh57akzs83"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_lambda_function.migrate_function will be created
  + resource "aws_lambda_function" "migrate_function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "lambda_binary.zip"
      + function_name                  = "recruit-service-board-migrate"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::113713103169:role/recruit-service-board-lambda-execution"
      + runtime                        = "go1.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + vpc_config {
          + security_group_ids = [
              + "sg-046b937d63c1b724e",
            ]
          + subnet_ids         = [
              + "subnet-04400242864195eba",
              + "subnet-0e7f8c94361b73d2f",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # aws_lambda_permission.apigw will be created
  + resource "aws_lambda_permission" "apigw" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "recruit-service-board-migrate"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_lambda_function.migrate_function: Creating...
aws_lambda_function.migrate_function: Still creating... [10s elapsed]
aws_lambda_function.migrate_function: Still creating... [20s elapsed]
aws_lambda_function.migrate_function: Still creating... [30s elapsed]
aws_lambda_function.migrate_function: Still creating... [40s elapsed]
aws_lambda_function.migrate_function: Still creating... [50s elapsed]
aws_lambda_function.migrate_function: Still creating... [1m0s elapsed]
aws_lambda_function.migrate_function: Still creating... [1m10s elapsed]
aws_lambda_function.migrate_function: Still creating... [1m20s elapsed]
aws_lambda_function.migrate_function: Still creating... [1m30s elapsed]
aws_lambda_function.migrate_function: Still creating... [1m40s elapsed]
aws_lambda_function.migrate_function: Still creating... [1m50s elapsed]
aws_lambda_function.migrate_function: Still creating... [2m0s elapsed]
aws_lambda_function.migrate_function: Still creating... [2m10s elapsed]
aws_lambda_function.migrate_function: Creation complete after 2m15s [id=recruit-service-board-migrate]
aws_lambda_permission.apigw: Creating...
aws_api_gateway_integration.integration: Creating...
aws_api_gateway_integration.integration: Creation complete after 0s [id=agi-rh57akzs83-qgpg3b-POST]
aws_api_gateway_deployment.deployment: Creating...
aws_lambda_permission.apigw: Creation complete after 0s [id=terraform-20230927073153605700000001]
aws_api_gateway_deployment.deployment: Creation complete after 1s [id=eazh2b]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":26,"Program":"tfcmt","SHA1":"9a7a3bb71945d989a6076a1bb6b55e82744c3f97","Vars":{},"WorkflowName":"Terraform"} -->